<template>
  <div class='book-wrapper'>
    <div v-for="(item, index) in bookList[activeCategory]" :key="index" class="book-item">
      <div class="cover">
        <img :src="item.imgSrc"class="medium-zoom-image">
      </div>
      <div class="info">
        <h3 :title="item.name" class="title">
          <span class="name">{{item.name}}</span>
          <span class="name-badge">
            <span class="badge error" style="vertical-align: top;">想看</span>
          </span>
        </h3>
        <p class="tags">
          <span class="tag">{{item.author}}</span>
        </p>
        <p :title="item.des" class="desc">{{item.des}}</p>
        <!-- <div class="time">
          看完：-<br>
          添加：2020-04-03
        </div> -->
      </div>
    </div>
  </div>
</template>

<script>
export default {
  props: {
    activeCategory: {
      type: String,
      default: '',
    }
  },
  created() {
    console.log(666, this.activeCategory);
  },
  data () {
    return {
      bookList: {
        biography: [
          { 
            name:'曾国藩（上中下）',
            author: '唐浩明',
            des: '长篇历史小说《曾国藩》既写曾国藩的文韬武略，也写他的待人处民与生活态度；既写他的困厄与成功，也写他的得宠与失宠。曾国藩制胜的兵法、治军行政的方针，他独特的人生观、处世哲学，他的文化素养和人格品位等等，都在作品中得以表现。',
            imgSrc: '/bookListImg/biography/曾国藩(上中下).jpg'
          },
        ],
        culture: [],
        economy: [
          { 
            name:'薛兆丰经济学讲义',
            author: '薛兆丰',
            des: '我们每天收到无数纷繁复杂的信息，看到各种光怪陆离的现象，世界是复杂的。世界又并不复杂，只是你需要一双慧眼。经济学是一种帮助你成为明白人的智慧，它是观察世界的视角和态度，而不是一堆函数、公式和图表。薛兆丰老师善于把复杂的现象用简单直接的方式说清楚。这本书讲解了生活中不可能绕过的经济学核心概念，比如稀缺、成本、价格、交易、信息不对称、收入等与个人生活密切相关的知识，通过大量真实案例的经济学分析，更实际、更有趣、更深入和彻底地将经济学思维运用于各种实际场景，帮你绕过经济学花招，理解现象背后的经济逻辑，从而启发你将同样的思维运用到日常生活和工作中去。你将摆脱直觉和经验的控制，拥有可以举一反三、能够学以致用的知识体系，从而对这个由海量陌生人连接而成的社会做出恰如其分的反应。相信读完本书之后，你会对自己身处的世界有更深刻的理解，成为这个复杂世界的明白人。',
            imgSrc: '/bookListImg/biography/薛兆丰经济学讲义.jpg'
          },
          { 
            name:'穷查理宝典',
            author: '[美] 彼得·考夫曼',
            des: '《穷查理宝典》收录了查理过去20年来主要的公开演讲。除简单而权威的查理传略外，其后的《芒格的生活、学习和决策方法》以及《芒格主义：查理的即席谈话》整理了芒格最精华的思维与决策方式和以往在伯克希尔·哈撒韦公司和西科金融公司年会上犀利——和幽默——的评论。而最后最珍贵的十一篇讲稿则全面展现了这个传奇人物的聪明才智。贯穿全书的是芒格展示出来的聪慧、机智，其令人敬服的价值观和深不可测的修辞天赋。他拥有百科全书式的知识，所以从古代的雄辩家，到18、19世纪的欧洲文豪，再到当代的流行文化偶像，这些人的名言他都能信手拈来，并用这些来强调终身学习和保持求知欲望的好处。',
            imgSrc: '/bookListImg/biography/穷查理宝典.jpg'
          },
          { 
            name:'美国陷阱',
            author: '[法] 弗雷德里克·皮耶鲁齐 / [法] 马修·阿伦',
            des: '2013年4月14日，美国纽约肯尼迪国际机场，法国阿尔斯通集团锅炉部全球负责人弗雷德里克•皮耶鲁齐，刚下飞机就被美国联邦调查局探员逮捕。 这场抓捕不仅仅是针对他个人的行为，而是美国政府针对法国阿尔斯通的系列行动之一。之后，美国司法部指控皮耶鲁齐涉嫌商业贿赂，并对阿尔斯通处以7.72亿美元罚款。阿尔斯通的电力业务，最终被行业内的主要竞争对手——美国通用电气公司收购。阿尔斯通这家曾经横跨全球电力能源与轨道交通行业的商业巨头，因此被美国人“肢解”。而皮耶鲁齐直到2018年9月才走出监狱，恢复自由。 在《美国陷阱》一书中，皮耶鲁齐以身陷囹圄的亲身经历披露了阿尔斯通被美国企业“强制”收购，以及美国利用《反海外腐败法》打击美国企业竞争对手的内幕。 这是一场隐秘的经济战争。',
            imgSrc: '/bookListImg/biography/美国陷阱.jpg'
          },
          { 
            name:'思考，快与慢',
            author: '[美] 丹尼尔·卡尼曼 / [美] Daniel Kahneman',
            des: '《纽约时报》2011年度十大好书新书上市，连续20多周蝉联亚马逊、《纽约时报》畅销书排行榜前20名，上市至今超过7个月，横扫全球各大畅销书排行榜，稳居亚马逊总榜前50名《经济学人》、《华尔街日报》、《卫报》、《纽约时报》、《金融时报》、《商业周刊》、《华盛顿邮报》、等国外权威媒体，《三联生活周刊》、《商学院》、《东方早报》等国内知名媒体争相报道，国内外读者好评如潮人类究竟有多理性？——思考，快与慢在书中，卡尼曼会带领我们体验一次思维的终极之旅。他认为，我们的大脑有快与慢两种作决定的方式。常用的无意识的“系统1”依赖情感、记忆和经验迅速作出判断，它见闻广博，使我们能够迅速对眼前的情况作出反应。但系统1也很容易上当，它固守“眼见即为事实”的原则，任由损失厌恶和乐观偏见之类的错觉引导我们作出错误的选择。有意识的“系统2”通过调动注意力来分析和解决问题，并作出决定，它比较慢，不容易出错，但它很懒惰，经常走捷径，直接采纳系统1的直觉型判断结果。',
            imgSrc: '/bookListImg/biography/思考，快与慢.jpg'
          },
        ],
        emotioCommunication: [
          { 
            name:'非暴力沟通',
            author: '马歇尔·卢森堡 (Marshall B.Rosenberg)',
            des: '作为一个遵纪守法的好人，也许我们从来没有想过和“暴力”扯上关系。不过如果稍微留意一下现实生活中的谈话方式，并且用心体会各种谈话方式给我们的不同感受，我们一定会发现，有些话的确伤人！言语上的职责、嘲讽、否定、说教以及任意打断、拒不回应、随意出口的评价和结论给我们带来的情感和精神上的创伤，甚至比肉体的伤害更加令人痛苦。这些无心或有意的语言暴力让人与人变得冷漠、隔阂、敌视。',
            imgSrc: '/bookListImg/biography/非暴力沟通.jpg'
          },
          { 
            name:'沟通的艺术',
            author: '[美] 罗纳德·B·阿德勒 / 拉塞尔·F·普罗科特',
            des: '本书分为“看入人里”“看出人外”和“看人之间”三个部分：“看入人里”主要探讨了与沟通者有关的因素，说明了人际关系的本质，强调自我在沟通中的角色，并分析了知觉与情绪在沟通中的重要性；“看出人外”聚焦于沟通者之外信息的发送与接收，分析了语言的运用和非语言线索的特征，强调了倾听的重要性；“看人之间”则主要讨论了关系的演变过程，侧重于亲密关系的区辨，提出了改善沟通氛围、处理人际冲突的各种沟通方法。',
            imgSrc: '/bookListImg/biography/沟通的艺术.jpg'
          },
          { 
            name:'乌合之众',
            author: '（法）勒庞',
            des: '古斯塔夫・勒庞 Gustave Le Bon(1841-1931) 法国著名社会心理学家。他自1894年始，写下一系列社会心理学著作，以本书最为著名；在社会心理学领域已有的著作中，最有影响的，也是这本并不很厚的《乌合之众》。古斯塔夫・勒庞在他在书中极为精致地描述了集体心态，对人们理解集体行为的作用以及对社会心理学的思考发挥了巨大影响。《乌合之众--大众心理研究》在西方已印至第29版，其观点新颖，语言生动，是群体行为的研究者不可不读的佳作。',
            imgSrc: '/bookListImg/biography/乌合之众.jpg'
          },
        ],
        famousBook: [
          { 
            name:'三国演义',
            author: '罗贯中',
            des: '三国演义》又名《三国志演义》、《三国志通俗演义》，是我国小说史上最著名最杰出的长篇章回体历史小说。 《三国演义》的作者是元末明初人罗贯中，由毛纶，毛宗岗父子批改。在其成书前，“三国故事”已经历了数百年的历史发展过程。在唐代，三国故事已广为流传，连儿童都很熟悉。随着市民文艺的发展，宋代的“说话”艺人，已有专门说三国故事的，当时称为“说三分”。',
            imgSrc: '/bookListImg/biography/三国演义.jpg'
          },
          { 
            name:'水浒传',
            author: '施耐庵',
            des: '《水浒传》是我国人民最喜爱的古典长篇白话小说之一。全书以宋江领导的农民起义为主要题材，艺术地再现了中国古代人民反抗压迫、英勇斗争的悲壮画卷。作品充分暴露了封建统治阶级的腐朽和残暴，揭露了当时尖锐对立的社会矛盾和“官逼民反”的残酷现实，成功地塑造了鲁智深、李逵、武松、林冲、阮小七等一批英雄人物。《水浒传》为“家庭书架”从书之一，表现了一群不堪暴政欺压的“好汉”揭竿而起，聚义水泊梁山，直至接受朝廷招安而失败的全过程。',
            imgSrc: '/bookListImg/biography/水浒传.jpg'
          },
          { 
            name:'红楼梦',
            author: '[清] 曹雪芹 著 / 高鹗 续',
            des: '《红楼梦》是一部百科全书式的长篇小说。以宝黛爱情悲剧为主线，以四大家族的荣辱兴衰为背景，描绘出18世纪中国封建社会的方方面面，以及封建专制下新兴资本主义民主思想的萌动。结构宏大、情节委婉、细节精致，人物形象栩栩如生，声口毕现，堪称中国古代小说中的经 典。',
            imgSrc: '/bookListImg/biography/红楼梦.jpg'
          },
          { 
            name:'西游记',
            author: '吴承恩',
            des: '《西游记》的艺术虚构正是建立在传统艺术经验和这种社会的宗教性观念和风习的基础之上的，但它又以作者融会了传统艺术经验所形成的艺术的独创性批判了社会的宗教性观念，或更正确地说，和社会的宗教性观念开了玩笑，进行了潮弄。这是这部演述超人间故事的神魔小说最突出、最优异的品质，也是它的艺术价值和魅力的最根本的所在。',
            imgSrc: '/bookListImg/biography/西游记.jpg'
          },
        ],
        history: [
          { 
            name:'台湾老兵口述历史',
            author: '赵 川',
            des: '国内首部深度呈现台湾老兵烽火岁月与飘零时世的人生大书。台湾老兵是历史的亲历者和见证者，如同历史的活化石，其本身就是一段历史的载体。他们每个人都是一部战争史，一部抗争史。',
            imgSrc: '/bookListImg/biography/台湾老兵口述历史.jpg'
          },
          { 
            name:'晚清之后是民国',
            author: '赵焰',
            des: '本书系在全国颇有影响的“晚清三部曲”（《晚清有个李鸿章》、《晚清有个曾国藩》、《晚清有个袁世凯》）续篇，由晚清而入民国，由个案扩及群像，从大历史角度描述自袁世凯去世后，中国社会各方面的嬗变。古老的东方帝国，在一跃成为亚洲最早的共和国之后，不但没有新生，反而陷入内斗的泥淖，一切都在崩溃：政治和军事，经济和文化，信心和信仰……最后不得不以再度集权的方式，画了一个简单的句号。真实的北洋民国是怎样一种状态？内外各种势力如何博弈？世道人心如何演化？历史走向是否可以掌控？这一切与国民性有何关联？作者从容织出一张历史的网，其间，偶然与必然交错，变幻与恒定交织，振奋与悲怆交替。',
            imgSrc: '/bookListImg/biography/晚清之后是民国.jpg'
          },
          { 
            name:'往事并不如烟',
            author: '章诒和',
            des: '本书记录了改革开放以来中国第一批本硕连读生——中国社会科学院研究生院经济系81级研究生班15人从毕业至今20年来的人生历程，展示了这批人在改革开放的大潮中奋力拼搏，在经济学界、商界以及政界取得卓越成就，推动中国改革开放进程的长篇画卷。同时本书还讲述了这批同学二十年间的风雨历程、酸甜苦辣，以及许多鲜为人知的故事。读者通过对“他们”的阅读，必将会联想自己的过去、憧憬自己的未来，能够深察寰球翻天覆地的变化，能够促使个人命运与时代的交融。',
            imgSrc: '/bookListImg/biography/往事并不如烟.jpg'
          },
        ],
        literature: [],
        manage: [
          { 
            name:'原则',
            author: '[美] 瑞·达利欧',
            des: '※ 华尔街投资大神、对冲基金公司桥水创始人，人生经验之作作者瑞·达利欧出身美国普通中产家庭，26岁时被炒鱿鱼后在自己的两居室内创办了桥水，现在桥水管理资金超过1 500亿美元，截至2015年年底，盈利超过450亿美元。达利欧曾成功预测2008年金融危机，现在将其白手起 家以来40多年的生活和工作原则公开。※ 多角度、立体阐述生活、工作、管理原则',
            imgSrc: '/bookListImg/biography/原则.jpg'
          },
        ],
        novel: [
          {
            name:'清单人生',
            author: '［瑞典］弗雷德里克·巴克曼',
            des: '布里特-玛丽是那种你能想象到的最无趣的63岁女人，因为她不允许生活里有任何波澜。每天6点准时起床，12点必须用餐，从不在天黑后出门，床单整理得一尘不染，否则就不...',
            imgSrc: '/bookListImg/biography/清单人生.jpg'
          },
          {
            name:'断代',
            author: '郭强生',
            des: '曾在交际圈风光无限的老七已步入中年，在亲密好友重病离世之后，还是坚持在台北闹区独自守着“美乐地”酒吧。曾经被一个大学生伤得很深的他，对于追..',
            imgSrc: '/bookListImg/biography/断代.jpg'
          },
          {
            name:'你想活出怎样的人生',
            author: '吉野源三郎',
            des: '1937年，吉野源三郎写成本书，在传统价值面临崩坏的现代，书中所倡导的身为人的基本品格，特别令人动容。80年来，再没有一人比吉野源三郎擅长用如此生动的故事，教我们如何...',
            imgSrc: '/bookListImg/biography/你想活出怎样的人生.jpg'
          },
          {
            name:'动物农场',
            author: '[英]乔治·奥威尔',
            des: '本书是英国最著名20世纪小说家乔治·奥威尔的一部最有名的政治寓言体小说，故事描述了一场“动物主义”革命的酝酿、兴起和最终蜕变。一个农庄Manor Farm的动物...',
            imgSrc: '/bookListImg/biography/动物农场.jpg'
          },
          {
            name:'《1984》',
            author: '[英]奥威尔',
            des: '本书是英国作家乔治奥威尔创作的一部政治讽刺小说，小说创作于1948年，出版于1949年。书中讲述了一个令人感到窒息和恐怖的，以追逐权力为最终目标的假想的未来极权...',
            imgSrc: '/bookListImg/biography/《1984》.jpg'
          },
          {
            name:'平凡的世界',
            author: '路遥',
            des: '《平凡的世界》是中国作家路遥创作的一部百万字的小说。这是一部全景式地表现中国当代城乡社会生活的长篇小说，全书共三部。1986年12月首次出版。该书以中国70年代中期到80年代中期十年间为背景，通过复杂的矛盾纠葛，以孙少安和孙少平两兄弟为中心，刻画了当时社会各阶层众多普通人的形象；劳动与爱情...',
            imgSrc: '/bookListImg/biography/平凡的世界.jpg'
          },
          {
            name:'活着',
            author: '余华',
            des: '《活着》是作家余华的代表作之一，讲述了在大时代背景下，随着内战、三反五反，大跃进，文化大革命等社会变革，徐福贵的人生和家庭不断经受着苦难，到了最后所有亲人都先后离他而去，仅剩下年老的他和一头老牛相依为命。余华因这部小说于2004年3月荣获法兰西文学和艺术骑士勋章。',
            imgSrc: '/bookListImg/biography/活着.jpg'
          },
          {
            name:'解忧杂货铺',
            author: '东野圭吾',
            des: '《解忧杂货店》是日本作家东野圭吾写作的长篇小说。2011年于《小说野性时代》连载，于2012年3月由角川书店发行单行本。该书讲述了在僻静街道旁的一家杂货店，只要写下烦恼投进店前门卷帘门的投信口，第二天就会在店后的牛奶箱里得到回答：因男友身患绝症，年轻女孩月兔在爱情与梦想间徘徊；松冈克郎为...',
            imgSrc: '/bookListImg/biography/解忧杂货铺.jpg'
          },
          {
            name:'追风筝的人',
            author: '［美］卡勒德·胡赛尼',
            des: '许多年过去了，人们说陈年旧事可以被埋葬，然而我终于明白这是错的，因为往事会自行爬上来。回首前尘，我意识到在过去二十六年里，自己始终在窥视着那荒芜的小径。',
            imgSrc: '/bookListImg/biography/追风筝的人.jpg'
          },
          {
            name:'白夜行',
            author: '东野圭吾',
            des: '《白夜行》是日本作家东野圭吾创作的长篇小说，也是其代表作。该小说于1997年1月至1999年1月间连载于期刊，单行本1999年8月在日本发行。故事围绕着一对有着不同寻常情愫的小学生展开。1973年，大阪的一栋废弃建筑内发现了一具男尸，此后19...',
            imgSrc: '/bookListImg/biography/白夜行.jpg'
          },
          {
            name:'月亮与六便士',
            author: '威廉·萨默赛特·毛姆',
            des: '本书取材自法国后印象派画家高更的生平。一个生活安定的英国证券交易所的经纪人，却突然抛妻弃子，到巴黎去追求绘画的理想。他在异国不仅肉体受着贫穷和饥饿煎熬，而且为了...',
            imgSrc: '/bookListImg/biography/月亮与六便士.jpg'
          },
          {
            name:'三体',
            author: '刘慈欣',
            des: '《三体》是刘慈欣创作的系列长篇科幻小说，由《三体》、《三体Ⅱ·黑暗森林》、《三体Ⅲ·死神永生》组成，第一部于2006年5月起在《科幻世界》杂志上连载，第二部于2008年5月首次出版，第三部则于2010年11月出版。作品讲述了地球人类文明和三体文明的信息交流、生死搏杀及两个文明在宇宙中的兴衰历程',
            imgSrc: '/bookListImg/biography/三体.jpg'
          },
          {
            name:'小王子',
            author: '安托万·德·圣·埃克苏佩里',
            des: '《小王子》是法国作家安托万·德·圣·埃克苏佩里于1942年写成的著名儿童文学短篇小说。本书的主人公是来自外星球的小王子。书中以一位飞行员作为故事叙述者，讲述了小王子从自己星球出发前往地球的过程中，所经历的各种历险。作者以小王子的孩子式的眼光，透视出成人的空虚、盲目，愚妄和死板教条，用...',
            imgSrc: '/bookListImg/biography/小王子.jpg'
          },
          {
            name:'围城',
            author: '钱钟书',
            des: '《围城》是钱钟书所著的长篇小说，是中国现代文学史上一部风格独特的讽刺小说。被誉为“新儒林外史”。第一版于1947年由上海晨光出版公司出版。故事主要写抗战初期知识分子的群相。',
            imgSrc: '/bookListImg/biography/围城.jpg'
          },
          {
            name:'骆驼祥子',
            author: '老舍',
            des: '《骆驼祥子》是人民艺术家——老舍（舒庆春，1899-1966）所著的长篇小说，描述了20世纪20年代军阀混战时期人力车夫的悲惨命运。祥子是旧社会劳苦大众的代表人物。',
            imgSrc: '/bookListImg/biography/骆驼祥子.jpg'
          },
          {
            name:'霍乱时期的爱情',
            author: '加西亚·马尔克斯',
            des: '《霍乱时期的爱情》是哥伦比亚作家加西亚·马尔克斯创作的长篇小说，首次出版于1985年。该小说讲述了一段跨越半个多世纪的爱情故事：男女主人公在二十岁的时候没能结婚，因为他们太年轻了；经过各种人生曲折之后，到了八十岁，他们还是没能...',
            imgSrc: '/bookListImg/biography/霍乱时期的爱情.jpg'
          },
          {
            name:'你当像鸟飞往你的山',
            author: '塔拉·韦斯特弗',
            des: '《你当像鸟飞往你的山》是美国作者塔拉·韦斯特弗所写，南海出版公司出版的一本书籍。',
            imgSrc: '/bookListImg/biography/你当像鸟飞往你的山.jpg'
          },
          {
            name:'了不起的盖茨比',
            author: '弗·司各特·菲茨杰拉德',
            des: '《了不起的盖茨比》是美国作家弗·司各特·菲茨杰拉德创作的一部以以20世纪20年代的纽约市及长岛为背景的中篇小说，出版于1925年。主人公詹姆斯·卡兹本是北达科他州的一个贫穷的农家子弟，自幼梦想做个出人头地的大人物。经过一番努力，他终于步步高升，并更名为杰伊·盖茨比。他在一个军训营里任中尉..',
            imgSrc: '/bookListImg/biography/了不起的盖茨比.jpg'
          }
        ],
        philosophy: [],
        psychology: [
          {
            name:'超越智商',
            author: '[美]基思 E. 斯坦诺维奇',
            des: '高智商，就意味着能做出正确的、好的决策？错！研究表示，公认的聪明人在决策的正确率方面与普通人无异，有时候也会:数学家在毫无利好消息的情况，大量买入持续下跌的股票，最终输掉所有积蓄',
            imgSrc: '/bookListImg/biography/超越智商.jpg'
          },
          { 
            name:'天才在左疯子在右',
            author: '高铭',
            des: '《天才在左疯子在右》是2010年由武汉大学出版社出版的图书，作者是高铭。该书以访谈录的形式记载了生活在另一个角落的人群（精神病患者、心理障碍者等边缘人）深刻、视角独特的所思所想，让人们可以了解到疯子亦或是天才真正的内心世界',
            imgSrc: '/bookListImg/biography/天才在左疯子在右.jpg'
          },
          { 
            name:'这不是你的错',
            author: '[美]马克·沃林恩',
            des: '《这不是你的错：海灵格家庭创伤疗愈之道》是2017年出版的图书，作者是[美]马克·沃林恩（Mark Wolynn）。',
            imgSrc: '/bookListImg/biography/这不是你的错.jpg'
          },
          { 
            name:'拥抱你的内在小孩',
            author: '克里希那南达',
            des: '《拥抱你的内在小孩》是2011年由漓江出版社出版的图书，作者是克里希那南达，本书是克里希那南达和妻子阿曼娜共同撰写的爱与信任三部曲之一。本书的核心思想是面对恐惧，并将恐惧转化为爱。从心理学的角度，讲述从恐惧到爱的旅程。',
            imgSrc: '/bookListImg/biography/拥抱你的内在小孩.jpg'
          },
          { 
            name:'自控力',
            author: '凯利·麦格尼格尔',
            des: '本书是斯坦福大学最受欢迎心理学课程。 作者麦格尼格尔教授吸收了心理学、神经学和经济学等学科的最新洞见，为斯坦福大学继续教育项目开设了一门叫做“意志力科学”的课程...',
            imgSrc: '/bookListImg/biography/自控力.jpg'
          }
        ],
        religion: [],
        science: [],
        selfImprovement: [],
        workplace: [],
      },
    };
  },
};
</script>
<style>
.book-wrapper {
  color: #aaa;
  display: flex;
  flex-wrap: wrap;
}
.book-item {
  margin: 0 0 1.5rem;
  padding: 0.5rem 0.8rem;
  width: 45%;
  box-shadow: var(--box-shadow);
  border-radius: 0.5rem;
  display: flex;
  flex-wrap: wrap;
  justify-content: left;
}
.cover {
  align-self: center;
  height: 100%;
}
.cover img {
  width: 9rem;
  min-width: 8.5rem;
  max-height: 12rem;
  height: 100%;
}
.info {
  width: 11rem;
  margin-left: 0.8rem;
}
.info .title {
  margin: 0.2rem 0 0.5rem;
  white-space: nowrap;
  font-size: 1.35rem;
}
.info .title .name {
  overflow: hidden;
  text-overflow: ellipsis;
  white-space: nowrap;
  max-width: 75%;
  display: inline-block;
}
.info .title .name-badge {
  white-space: nowrap;
}
.info .title .name-badge .badge {
  display: inline-block;
  font-size: 14px;
  height: 18px;
  line-height: 18px;
  border-radius: 0.25rem;
  padding: 0 6px;
  color: #fff;
  background-color: #ff9c99;
}
.info .tags {
  margin: 0.2rem 0;
  overflow: hidden;
  white-space: nowrap;
}
.info .tags .tag {
  padding: 0.2rem;
  font-size: 0.5rem;
  background: #a3a3a3;
  color: #fff;
  border-radius: 0.25rem;
  margin-right: 0.2rem;
}
.info .desc {
  margin: 0 0 0.5rem;
  font-size: 0.8rem;
  overflow: hidden;
  white-space: normal;
  text-overflow: ellipsis;
  display: -webkit-box;
  -webkit-box-orient: vertical;
  -webkit-line-clamp: 4;
  height: 8rem;
}
.info .time {
  margin: 0;
  font-size: 0.6rem;
  color: #808080;
  height: 22%;
}
@media screen and (max-width: 980px) {
  .book-item {
    margin: 0 0 1.5rem;
    padding: 0.5rem 0.8rem;
    width: 100%;
    box-shadow: var(--box-shadow);
    border-radius: 0.5rem;
    display: flex;
    flex-wrap: wrap;
    justify-content: left;
  }
}
</style>
